#### MetallicpaintFinishType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "MetallicpaintFinish" from the "MetallicPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MetallicpaintFinishType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MetallicpaintFinishType ``` |

| Visual C++ |
| --- |
| ``` public enum class MetallicpaintFinishType ``` |

# Members

| Member name | Description |
| --- | --- |
| Smooth |  |
| Peeling |  |

# See Also

Autodesk.Revit.DB.Visual Namespace